## Practical-2

In [114]:
## Working with Dataframes

### Creating DataFrames from scratch

There are many ways to create a DataFrame from scratch, but a simple option is to just use a simple dictionary.

In [115]:
import pandas as pd;

In [116]:
data = {  'android': [31,32,33,41],  'python': [51,52,53,0],   'java': [1,2,3,4]   }
i=0

data

{'android': [31, 32, 33, 41], 'python': [51, 52, 53, 0], 'java': [1, 2, 3, 4]}

In [117]:
languages = pd.DataFrame(data)

languages

   android  python  java
0       31      51     1
1       32      52     2
2       33      53     3
3       41       0     4

Each (key) in dct corresponds to a column-header in the resulting DataFrame purchases. <br>
Each (value) in dct corresponds to row in the resulting dataframe.

In [118]:
type(languages)

pandas.core.frame.DataFrame

The auto Index of this DataFrame is the numbers 0-3, but it is possible to specify our own index.

In [119]:
languages.iloc[0]

android    31
python     51
java        1
Name: 0, dtype: int64

In [120]:
languages.iloc[2]

android    33
python     53
java        3
Name: 2, dtype: int64

In [121]:
languages.iloc[0,1]

51

In [122]:
languages.iloc[1,2]

2

In [123]:
languages.iloc[3,2]

4

In [124]:
languages = pd.DataFrame(data, index=['january', 'february', 'march', 'april'])

languages

          android  python  java
january        31      51     1
february       32      52     2
march          33      53     3
april          41       0     4

In [125]:
languages = pd.DataFrame(data, index=['day-1', 'day-2', 'day-3', 'day-4'])

languages

       android  python  java
day-1       31      51     1
day-2       32      52     2
day-3       33      53     3
day-4       41       0     4

In [127]:
languages.loc['day-1']['java']

1

In [131]:

languages.iloc[0]['android']

31

In [135]:
languages.iloc[1]['python']

52

In [136]:
languages.iloc[0]['python']

51

### Accessing dataframe elements

In [138]:
trp = {'biggboss':[1,2,3,4],'rodix':[5,6,7,8],'tv9':[9,10,11,12]}

df = pd.DataFrame(trp)

df

   biggboss  rodix  tv9
0         1      5    9
1         2      6   10
2         3      7   11
3         4      8   12

In [139]:
df

   biggboss  rodix  tv9
0         1      5    9
1         2      6   10
2         3      7   11
3         4      8   12

In [140]:
df.shape

(4, 3)

In [141]:
df.shape[0]

4

In [142]:
c = df.shape[1]

print("No. of columns = ",c)

No. of columns =  3

Let us access the value 1 at index 0 in the cloumn 'A':

In [143]:
# Using iloc[]
df.iloc[0][0]

1

In [147]:
# Using loc[]
print(df.loc[0]['rodix'])

5

In [148]:
# Using at[]
print(df.at[0,'tv9'])

9

In [149]:
# Using iat[]
print(df.iat[0,0])

1

### Row appending

### Row slicing

In [150]:
# df[2]

In [151]:
df[1:2]

   biggboss  rodix  tv9
1         2      6   10

In [152]:
df[1:3]

   biggboss  rodix  tv9
1         2      6   10
2         3      7   11

In [153]:
df[2:]

   biggboss  rodix  tv9
2         3      7   11
3         4      8   12

In [177]:
df['biggboss']

0    1
1    2
2    3
3    4
Name: biggboss, dtype: int64

In [178]:
df['tv9']

0     9
1    10
2    11
3    12
Name: tv9, dtype: int64

In [179]:
df.biggboss

0    1
1    2
2    3
3    4
Name: biggboss, dtype: int64

In [180]:
df.rodix

0    5
1    6
2    7
3    8
Name: rodix, dtype: int64

### Dropping rows

In [181]:
df2 = df.drop(0)
df2

   biggboss  rodix  tv9
1         2      6   10
2         3      7   11
3         4      8   12

In [182]:
df

   biggboss  rodix  tv9
0         1      5    9
1         2      6   10
2         3      7   11
3         4      8   12

In [183]:
df2

   biggboss  rodix  tv9
1         2      6   10
2         3      7   11
3         4      8   12

In [184]:
df2.drop(2,inplace=True)
df2

   biggboss  rodix  tv9
1         2      6   10
3         4      8   12

In [185]:
dct = {'A':[11,22,33,44],'B':[55,66,77,88],'C':[99,110,111,112]}
df2 = pd.DataFrame(dct)

df2

    A   B    C
0  11  55   99
1  22  66  110
2  33  77  111
3  44  88  112

### Appending dataframe to another dataframe

In [186]:
df3 = df.append(df2)

df3

   biggboss  rodix   tv9     A     B      C
0       1.0    5.0   9.0   NaN   NaN    NaN
1       2.0    6.0  10.0   NaN   NaN    NaN
2       3.0    7.0  11.0   NaN   NaN    NaN
3       4.0    8.0  12.0   NaN   NaN    NaN
0       NaN    NaN   NaN  11.0  55.0   99.0
1       NaN    NaN   NaN  22.0  66.0  110.0
2       NaN    NaN   NaN  33.0  77.0  111.0
3       NaN    NaN   NaN  44.0  88.0  112.0

In [187]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 0 to 3
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   biggboss  4 non-null      float64
 1   rodix     4 non-null      float64
 2   tv9       4 non-null      float64
 3   A         4 non-null      float64
 4   B         4 non-null      float64
 5   C         4 non-null      float64
dtypes: float64(6)
memory usage: 448.0 bytes

### Handling duplicates

In [188]:
df3 = df3.append(df)

In [189]:
df3

   biggboss  rodix   tv9     A     B      C
0       1.0    5.0   9.0   NaN   NaN    NaN
1       2.0    6.0  10.0   NaN   NaN    NaN
2       3.0    7.0  11.0   NaN   NaN    NaN
3       4.0    8.0  12.0   NaN   NaN    NaN
0       NaN    NaN   NaN  11.0  55.0   99.0
1       NaN    NaN   NaN  22.0  66.0  110.0
2       NaN    NaN   NaN  33.0  77.0  111.0
3       NaN    NaN   NaN  44.0  88.0  112.0
0       1.0    5.0   9.0   NaN   NaN    NaN
1       2.0    6.0  10.0   NaN   NaN    NaN
2       3.0    7.0  11.0   NaN   NaN    NaN
3       4.0    8.0  12.0   NaN   NaN    NaN

In [190]:
df4 = df3.drop_duplicates()
df4

   biggboss  rodix   tv9     A     B      C
0       1.0    5.0   9.0   NaN   NaN    NaN
1       2.0    6.0  10.0   NaN   NaN    NaN
2       3.0    7.0  11.0   NaN   NaN    NaN
3       4.0    8.0  12.0   NaN   NaN    NaN
0       NaN    NaN   NaN  11.0  55.0   99.0
1       NaN    NaN   NaN  22.0  66.0  110.0
2       NaN    NaN   NaN  33.0  77.0  111.0
3       NaN    NaN   NaN  44.0  88.0  112.0

In [191]:
df3.drop_duplicates(inplace=True)
df3

   biggboss  rodix   tv9     A     B      C
0       1.0    5.0   9.0   NaN   NaN    NaN
1       2.0    6.0  10.0   NaN   NaN    NaN
2       3.0    7.0  11.0   NaN   NaN    NaN
3       4.0    8.0  12.0   NaN   NaN    NaN
0       NaN    NaN   NaN  11.0  55.0   99.0
1       NaN    NaN   NaN  22.0  66.0  110.0
2       NaN    NaN   NaN  33.0  77.0  111.0
3       NaN    NaN   NaN  44.0  88.0  112.0

### Working with column names

In [192]:
df3.columns

Index(['biggboss', 'rodix', 'tv9', 'A', 'B', 'C'], dtype='object')

Renaming columns

In [193]:
df3.rename(columns={'A':'sony','C':'cartoon'},inplace=True)
df3

   biggboss  rodix   tv9  sony     B  cartoon
0       1.0    5.0   9.0   NaN   NaN      NaN
1       2.0    6.0  10.0   NaN   NaN      NaN
2       3.0    7.0  11.0   NaN   NaN      NaN
3       4.0    8.0  12.0   NaN   NaN      NaN
0       NaN    NaN   NaN  11.0  55.0     99.0
1       NaN    NaN   NaN  22.0  66.0    110.0
2       NaN    NaN   NaN  33.0  77.0    111.0
3       NaN    NaN   NaN  44.0  88.0    112.0

In [194]:
df3

   biggboss  rodix   tv9  sony     B  cartoon
0       1.0    5.0   9.0   NaN   NaN      NaN
1       2.0    6.0  10.0   NaN   NaN      NaN
2       3.0    7.0  11.0   NaN   NaN      NaN
3       4.0    8.0  12.0   NaN   NaN      NaN
0       NaN    NaN   NaN  11.0  55.0     99.0
1       NaN    NaN   NaN  22.0  66.0    110.0
2       NaN    NaN   NaN  33.0  77.0    111.0
3       NaN    NaN   NaN  44.0  88.0    112.0

In [198]:
df3.columns = [ col.lower()  for col in df3.columns ]

df3

   biggboss  rodix   tv9  sony     b  cartoon
0       1.0    5.0   9.0   NaN   NaN      NaN
1       2.0    6.0  10.0   NaN   NaN      NaN
2       3.0    7.0  11.0   NaN   NaN      NaN
3       4.0    8.0  12.0   NaN   NaN      NaN
0       NaN    NaN   NaN  11.0  55.0     99.0
1       NaN    NaN   NaN  22.0  66.0    110.0
2       NaN    NaN   NaN  33.0  77.0    111.0
3       NaN    NaN   NaN  44.0  88.0    112.0

### Dropping columns

In [199]:
# tmp = df3.drop('nadiad')      ## This won't work

tmp = df3.drop('nadiad', axis = 1)
tmp

KeyError: "['nadiad'] not found in axis"

In [200]:
tmp = df3.drop(df3.columns[[1]],axis=1)  ## very dangerous
tmp

   biggboss   tv9  sony     b  cartoon
0       1.0   9.0   NaN   NaN      NaN
1       2.0  10.0   NaN   NaN      NaN
2       3.0  11.0   NaN   NaN      NaN
3       4.0  12.0   NaN   NaN      NaN
0       NaN   NaN  11.0  55.0     99.0
1       NaN   NaN  22.0  66.0    110.0
2       NaN   NaN  33.0  77.0    111.0
3       NaN   NaN  44.0  88.0    112.0

In [205]:
tmp.drop('tv9',axis=1,inplace=True)
tmp

   index  biggboss  sony     b  cartoon
0      0       1.0   NaN   NaN      NaN
1      1       2.0   NaN   NaN      NaN
2      2       3.0   NaN   NaN      NaN
3      3       4.0   NaN   NaN      NaN
4      0       NaN  11.0  55.0     99.0
5      1       NaN  22.0  66.0    110.0
6      2       NaN  33.0  77.0    111.0
7      3       NaN  44.0  88.0    112.0

Observe indices in the above output.

In [206]:
tmp.loc[0]

index       0.0
biggboss    1.0
sony        NaN
b           NaN
cartoon     NaN
Name: 0, dtype: float64

### So, how to reset index?

In [207]:
tmp.reset_index(inplace=True)
tmp

   level_0  index  biggboss  sony     b  cartoon
0        0      0       1.0   NaN   NaN      NaN
1        1      1       2.0   NaN   NaN      NaN
2        2      2       3.0   NaN   NaN      NaN
3        3      3       4.0   NaN   NaN      NaN
4        4      0       NaN  11.0  55.0     99.0
5        5      1       NaN  22.0  66.0    110.0
6        6      2       NaN  33.0  77.0    111.0
7        7      3       NaN  44.0  88.0    112.0